//Задача 24: Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.

// Console.Clear();
// Console.Write("Введите число: ");
// double n = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine((1 + n) / 2 * n);


//Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// Console.Clear();
// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// int result = 0;
// while (n > 0)
// {
//     n = n / 10;
//     result++; // result = result + 1
// }
// Console.WriteLine(result);

// Задача 30: Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
// [1,0,1,1,0,1,0,0]

// int[] array = new int[8];

// for (int i = 0; i < array.Length; i++)
// {
//    array[i] = new Random().Next(0, 2);

// }
// Console.WriteLine($"[{string.Join(", ", array)}]");

